Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMC20_DFP/3.2.44/Microchip.SAMC20_DFP.pdsc
      <condition id="C Exe">
         <accept Tcompiler="ARMCC" Toutput="exe"/>
         <accept Tcompiler="GCC" Toutput="exe"/>
         <accept Tcompiler="IAR" Toutput="exe"/>
      </condition>
      <condition id="C Lib">
         <accept Tcompiler="ARMCC" Toutput="lib"/>
         <accept Tcompiler="GCC" Toutput="lib"/>
         <accept Tcompiler="IAR" Toutput="lib"/>
      </condition>
      <condition id="ATSAMC20G17A">
         <require Dvendor="Microchip:3" Dname="ATSAMC20G17A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC20G16A">
         <require Dvendor="Microchip:3" Dname="ATSAMC20G16A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC20J18A">
         <require Dvendor="Microchip:3" Dname="ATSAMC20J18A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC20N18A">
         <require Dvendor="Microchip:3" Dname="ATSAMC20N18A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC20J15A">
         <require Dvendor="Microchip:3" Dname="ATSAMC20J15A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC20G18A">
         <require Dvendor="Microchip:3" Dname="ATSAMC20G18A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC20J17AU">
         <require Dvendor="Microchip:3" Dname="ATSAMC20J17AU"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC20J16A">
         <require Dvendor="Microchip:3" Dname="ATSAMC20J16A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC20J17A">
         <require Dvendor="Microchip:3" Dname="ATSAMC20J17A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC20E16A">
         <require Dvendor="Microchip:3" Dname="ATSAMC20E16A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC20J18AU">
         <require Dvendor="Microchip:3" Dname="ATSAMC20J18AU"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC20N17A">
         <require Dvendor="Microchip:3" Dname="ATSAMC20N17A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC20E18A">
         <require Dvendor="Microchip:3" Dname="ATSAMC20E18A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC20E17A">
         <require Dvendor="Microchip:3" Dname="ATSAMC20E17A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC20E15A">
         <require Dvendor="Microchip:3" Dname="ATSAMC20E15A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC20G15A">
         <require Dvendor="Microchip:3" Dname="ATSAMC20G15A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.2.0" condition="ATSAMC20G17A">
         <description>Headers and startup code for Microchip ATSAMC20G17A</description>
         <files>
            <file condition="C" category="include" name="samc20/include"/>
            <file condition="C" category="header" name="samc20/include/sam.h"/>
            <file condition="C Exe" category="source" name="samc20/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samc20/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samc20/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samc20/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samc20/gcc/gcc/startup_samc20g17a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samc20/gcc/system_samc20g17a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samc20/gcc/gcc/samc20g17a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samc20/gcc/gcc/samc20g17a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc20/armcc/armcc/startup_samc20g17a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc20/armcc/system_samc20g17a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc20/iar/system_samc20.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc20/iar/iar/startup_samc20.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samc20/iar/iar/samc20g17a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samc20/iar/iar/samc20g17a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.2.0" condition="ATSAMC20G16A">
         <description>Headers and startup code for Microchip ATSAMC20G16A</description>
         <files>
            <file condition="C" category="include" name="samc20/include"/>
            <file condition="C" category="header" name="samc20/include/sam.h"/>
            <file condition="C Exe" category="source" name="samc20/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samc20/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samc20/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samc20/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samc20/gcc/gcc/startup_samc20g16a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samc20/gcc/system_samc20g16a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samc20/gcc/gcc/samc20g16a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samc20/gcc/gcc/samc20g16a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc20/armcc/armcc/startup_samc20g16a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc20/armcc/system_samc20g16a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc20/iar/system_samc20.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc20/iar/iar/startup_samc20.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samc20/iar/iar/samc20g16a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samc20/iar/iar/samc20g16a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.2.0" condition="ATSAMC20J18A">
         <description>Headers and startup code for Microchip ATSAMC20J18A</description>
         <files>
            <file condition="C" category="include" name="samc20/include"/>
            <file condition="C" category="header" name="samc20/include/sam.h"/>
            <file condition="C Exe" category="source" name="samc20/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samc20/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samc20/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samc20/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samc20/gcc/gcc/startup_samc20j18a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samc20/gcc/system_samc20j18a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samc20/gcc/gcc/samc20j18a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samc20/gcc/gcc/samc20j18a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc20/armcc/armcc/startup_samc20j18a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc20/armcc/system_samc20j18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc20/iar/system_samc20.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc20/iar/iar/startup_samc20.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samc20/iar/iar/samc20j18a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samc20/iar/iar/samc20j18a_sram.icf" attr="config"/>
         </files>
      </component>
