Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMC20_DFP/3.2.44/Microchip.SAMC20_DFP.pdsc
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.2.0" condition="ATSAMC20J17A">
         <description>Headers and startup code for Microchip ATSAMC20J17A</description>
         <files>
            <file condition="C" category="include" name="samc20/include"/>
            <file condition="C" category="header" name="samc20/include/sam.h"/>
            <file condition="C Exe" category="source" name="samc20/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samc20/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samc20/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samc20/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samc20/gcc/gcc/startup_samc20j17a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samc20/gcc/system_samc20j17a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samc20/gcc/gcc/samc20j17a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samc20/gcc/gcc/samc20j17a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc20/armcc/armcc/startup_samc20j17a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc20/armcc/system_samc20j17a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc20/iar/system_samc20.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc20/iar/iar/startup_samc20.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samc20/iar/iar/samc20j17a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samc20/iar/iar/samc20j17a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.2.0" condition="ATSAMC20E16A">
         <description>Headers and startup code for Microchip ATSAMC20E16A</description>
         <files>
            <file condition="C" category="include" name="samc20/include"/>
            <file condition="C" category="header" name="samc20/include/sam.h"/>
            <file condition="C Exe" category="source" name="samc20/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samc20/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samc20/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samc20/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samc20/gcc/gcc/startup_samc20e16a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samc20/gcc/system_samc20e16a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samc20/gcc/gcc/samc20e16a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samc20/gcc/gcc/samc20e16a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc20/armcc/armcc/startup_samc20e16a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc20/armcc/system_samc20e16a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc20/iar/system_samc20.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc20/iar/iar/startup_samc20.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samc20/iar/iar/samc20e16a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samc20/iar/iar/samc20e16a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.2.0" condition="ATSAMC20J18AU">
         <description>Headers and startup code for Microchip ATSAMC20J18AU</description>
         <files>
            <file condition="C" category="include" name="samc20/include"/>
            <file condition="C" category="header" name="samc20/include/sam.h"/>
            <file condition="C Exe" category="source" name="samc20/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samc20/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samc20/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samc20/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samc20/gcc/gcc/startup_samc20j18au.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samc20/gcc/system_samc20j18au.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samc20/gcc/gcc/samc20j18au_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samc20/gcc/gcc/samc20j18au_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc20/armcc/armcc/startup_samc20j18au.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc20/armcc/system_samc20j18au.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc20/iar/system_samc20.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc20/iar/iar/startup_samc20.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samc20/iar/iar/samc20j18au_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samc20/iar/iar/samc20j18au_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.2.0" condition="ATSAMC20N17A">
         <description>Headers and startup code for Microchip ATSAMC20N17A</description>
         <files>
            <file condition="C" category="include" name="samc20n/include"/>
            <file condition="C" category="header" name="samc20n/include/sam.h"/>
            <file condition="C Exe" category="source" name="samc20n/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samc20n/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samc20n/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samc20n/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samc20n/gcc/gcc/startup_samc20n17a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samc20n/gcc/system_samc20n17a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samc20n/gcc/gcc/samc20n17a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samc20n/gcc/gcc/samc20n17a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc20n/armcc/armcc/startup_samc20n17a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc20n/armcc/system_samc20n17a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc20n/iar/system_samc20.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc20n/iar/iar/startup_samc20.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samc20n/iar/iar/samc20n17a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samc20n/iar/iar/samc20n17a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.2.0" condition="ATSAMC20E18A">
         <description>Headers and startup code for Microchip ATSAMC20E18A</description>
         <files>
            <file condition="C" category="include" name="samc20/include"/>
            <file condition="C" category="header" name="samc20/include/sam.h"/>
            <file condition="C Exe" category="source" name="samc20/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samc20/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samc20/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samc20/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samc20/gcc/gcc/startup_samc20e18a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samc20/gcc/system_samc20e18a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samc20/gcc/gcc/samc20e18a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samc20/gcc/gcc/samc20e18a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc20/armcc/armcc/startup_samc20e18a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc20/armcc/system_samc20e18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc20/iar/system_samc20.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc20/iar/iar/startup_samc20.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samc20/iar/iar/samc20e18a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samc20/iar/iar/samc20e18a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.2.0" condition="ATSAMC20E17A">
         <description>Headers and startup code for Microchip ATSAMC20E17A</description>
         <files>
            <file condition="C" category="include" name="samc20/include"/>
            <file condition="C" category="header" name="samc20/include/sam.h"/>
            <file condition="C Exe" category="source" name="samc20/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samc20/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samc20/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samc20/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samc20/gcc/gcc/startup_samc20e17a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samc20/gcc/system_samc20e17a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samc20/gcc/gcc/samc20e17a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samc20/gcc/gcc/samc20e17a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc20/armcc/armcc/startup_samc20e17a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc20/armcc/system_samc20e17a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc20/iar/system_samc20.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc20/iar/iar/startup_samc20.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samc20/iar/iar/samc20e17a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samc20/iar/iar/samc20e17a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.2.0" condition="ATSAMC20E15A">
         <description>Headers and startup code for Microchip ATSAMC20E15A</description>
         <files>
            <file condition="C" category="include" name="samc20/include"/>
            <file condition="C" category="header" name="samc20/include/sam.h"/>
            <file condition="C Exe" category="source" name="samc20/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samc20/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samc20/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samc20/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samc20/gcc/gcc/startup_samc20e15a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samc20/gcc/system_samc20e15a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samc20/gcc/gcc/samc20e15a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samc20/gcc/gcc/samc20e15a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc20/armcc/armcc/startup_samc20e15a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc20/armcc/system_samc20e15a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc20/iar/system_samc20.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc20/iar/iar/startup_samc20.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samc20/iar/iar/samc20e15a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samc20/iar/iar/samc20e15a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.2.0" condition="ATSAMC20G15A">
         <description>Headers and startup code for Microchip ATSAMC20G15A</description>
         <files>
            <file condition="C" category="include" name="samc20/include"/>
            <file condition="C" category="header" name="samc20/include/sam.h"/>
            <file condition="C Exe" category="source" name="samc20/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samc20/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samc20/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samc20/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samc20/gcc/gcc/startup_samc20g15a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samc20/gcc/system_samc20g15a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samc20/gcc/gcc/samc20g15a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samc20/gcc/gcc/samc20g15a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc20/armcc/armcc/startup_samc20g15a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc20/armcc/system_samc20g15a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc20/iar/system_samc20.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc20/iar/iar/startup_samc20.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samc20/iar/iar/samc20g15a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samc20/iar/iar/samc20g15a_sram.icf" attr="config"/>
         </files>
      </component>
   </components>
</package>
